In [31]:
import numpy as np
import pandas as pd
import json

In [32]:
raw_data = json.load(open(r"C:\Users\anton\Desktop\Master-Oppgave\Kode\New_Traffic\weekly_data\weekly_volumes.json"))

In [33]:
def flatten(item):
    return [
        {
            "id": item["data"]["trafficData"]["trafficRegistrationPoint"]["id"],
            "name": item["data"]["trafficData"]["trafficRegistrationPoint"]["name"],
            "lat": item["data"]["trafficData"]["trafficRegistrationPoint"]["location"]["coordinates"]["latLon"]["lat"],
            "lon": item["data"]["trafficData"]["trafficRegistrationPoint"]["location"]["coordinates"]["latLon"]["lon"],
            "volume": month["total"]["volume"]["average"] if month and month["total"] and month["total"]["volume"] else np.nan,
            "year":month["year"] if month else np.nan,
            "month": month["month"] if month else np.nan,
            "heading1": byDirection["heading"] if byDirection["heading"] else np.nan,
            "volume_heading1": byDirection["total"]["volume"]["average"] if byDirection["total"]["volume"] else np.nan
        }
        for month in item["data"]["trafficData"]["volume"]["average"]["daily"]["byMonth"] #IF Remove byMonth -> New error, string must be integers 
        if month

        for byDirection in month["byDirection"]
        if byDirection
    ]

In [34]:
#Execute flatten function on data
data = []
for item in raw_data:
    data.extend(flatten(item))

In [35]:
#Display in dataframe
df = pd.DataFrame(data)

In [36]:
df.head()

,id,name,lat,lon,volume,year,month,heading1,volume_heading1
0,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13023.0,2018,1,STRANDTORGET FELT 1,6570
1,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13023.0,2018,1,SENTRUM FELT 2,6453
2,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13998.0,2018,2,STRANDTORGET FELT 1,7024
3,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13998.0,2018,2,SENTRUM FELT 2,6974
4,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13878.0,2018,3,STRANDTORGET FELT 1,6950

In [37]:
unique_id=df["id"].nunique()
print(unique_id)

641

In [38]:
df.nunique(axis=0)

id                  641
name                641
lat                 640
lon                 641
volume             6019
year                  1
month                12
heading1            606
volume_heading1    8061
dtype: int64

In [39]:
df = df.drop_duplicates(subset=["id", "month"])

In [40]:
df.nunique(axis=0)
df["volume"] = df["volume"].replace(np.nan, 0).astype(int)

In [41]:
df.head()


df = df.drop(columns=["heading1", "volume_heading1"])

In [42]:
df.head()

df["volume1"]=df["volume"]/2
df["volume2"]=df["volume"]/2

In [43]:
# check if column 'A' contains numeric values
if pd.api.types.is_numeric_dtype(df['volume1']):
    print('Column A contains numeric values')
else:
    print('Column A does not contain numeric values')

# view the rows in column 'A' with non-numeric values
non_numeric_rows = df.loc[~pd.to_numeric(df['volume1'], errors='coerce').notnull()]
print(non_numeric_rows)

Column A contains numeric values
Empty DataFrame
Columns: [id, name, lat, lon, volume, year, month, volume1, volume2]
Index: []

,id,name,lat,lon,volume,year,month,volume1,volume2
0,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13023,2018,1,6511.5,6511.5
2,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13998,2018,2,6999.0,6999.0
4,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13878,2018,3,6939.0,6939.0
6,41379V1201935,MESNADALSARMEN,61.115044,10.456279,14288,2018,4,7144.0,7144.0
8,41379V1201935,MESNADALSARMEN,61.115044,10.456279,14669,2018,5,7334.5,7334.5

In [46]:
df['volume1']=df['volume1'].round().astype(int)
df['volume2']=df['volume2'].round().astype(int)

In [47]:
df.head()

,id,name,lat,lon,volume,year,month,volume1,volume2
0,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13023,2018,1,6512,6512
2,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13998,2018,2,6999,6999
4,41379V1201935,MESNADALSARMEN,61.115044,10.456279,13878,2018,3,6939,6939
6,41379V1201935,MESNADALSARMEN,61.115044,10.456279,14288,2018,4,7144,7144
8,41379V1201935,MESNADALSARMEN,61.115044,10.456279,14669,2018,5,7334,7334

In [49]:
df.to_excel("weekly_data_xl.xlsx")